---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.EditingFailures.CannotDuplicateType
source: html/8b5a929c-efc6-524f-5728-f4b3e67eadfe.htm
---
# Autodesk.Revit.DB.BuiltInFailures.EditingFailures.CannotDuplicateType Property

Cannot Duplicate Type

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotDuplicateType { get; }
```